# Беремо готовий "чистий" образ (картинку) Linux з уже встановленим Python.
# 3.10-slim - це легка, мінімальна версія, що ідеально для сервера.
FROM python:3.10-slim


# Створюємо папку /app всередині контейнера.
WORKDIR /app


COPY moduls.txt .

# Запускаємо pip, щоб він встановив усе зі списку.
RUN pip install --no-cache-dir -r moduls.txt


#копіюємо решту нашого коду:
COPY . .


# коли контейнер СТАРТУЄ. - "Запусти uvicorn, візьми 'app' з файлу 'chat',
# і слухай на всіх IP-адресах ('0.0.0.0') на порту 8000".
# '0.0.0.0'.
CMD uvicorn chat:app --host 0.0.0.0 --port $PORT